# Создать строку равную предпоследнему символу введенной строки.

string = input()

print(string[-2])
