# Создать строку равную третьему символу введенной строки.

string = input()

print(string[2])
