# Создать строку равную первым пяти символам введенной строки.

string = input()

print(string[:5])
