# Создать строку равную введенной строке без последних двух символов.

string = input()

print(string[:-2])
